In [1]:
import pandas as pd   #most important thing is what we need to find is alwasys y

In [2]:
dataset = pd.read_csv("TASK 21 - Copy.csv")

In [3]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   NAME                       20 non-null     object
 1   SOCIAL MEDIA               20 non-null     object
 2   USAGE TIME IN HOURS        20 non-null     int64
 3   STUDY HOURS                20 non-null     int64
 4   MARKS EXPECTED OUT OF 100  20 non-null     int64
dtypes: int64(3), object(2)
memory usage: 928.0+ bytes

In [4]:
dataset.head()

,NAME,SOCIAL MEDIA,USAGE TIME IN HOURS,STUDY HOURS,MARKS EXPECTED OUT OF 100
0,1. ayushi,instagram,1,2,70
1,2.aniroodh,facebook,2,0,20
2,3.vishwa,youtube,2,2,50
3,4.shubham,facebook,1,3,75
4,5.riya,instagram,1,1,65

In [5]:
dataset.shape

(20, 5)

In [6]:
dataset.columns

Index(['NAME', 'SOCIAL MEDIA', 'USAGE TIME IN HOURS', 'STUDY HOURS',
       'MARKS EXPECTED OUT OF 100'],
      dtype='object')

In [9]:
y = dataset['MARKS EXPECTED OUT OF 100']

In [11]:
y

0     70
1     20
2     50
3     75
4     65
5     60
6     60
7     65
8     60
9     60
10    70
11    75
12    80
13    40
14    65
15    90
16    85
17    65
18    75
19    80
Name: MARKS EXPECTED OUT OF 100, dtype: int64

In [27]:
x = dataset[['USAGE TIME IN HOURS',
           'STUDY HOURS'
            ]]

In [28]:
x

    USAGE TIME IN HOURS  STUDY HOURS
0                     1            2
1                     2            0
2                     2            2
3                     1            3
4                     1            1
5                     1            1
6                     2            3
7                     2            2
8                     1            2
9                     1            3
10                    1            2
11                    1            1
12                    1            2
13                    5            1
14                    1            2
15                    1            3
16                    2            2
17                    1            2
18                    1            3
19                    1            3

In [29]:
social_media = dataset["SOCIAL MEDIA"]

In [30]:
social_media

0     instagram
1      facebook
2       youtube
3      facebook
4     instagram
5     instagram
6       youtube
7     instagram
8       youtube
9     instagram
10    instagram
11      youtube
12    instagram
13    instagram
14      youtube
15      youtube
16    instagram
17    instagram
18      youtube
19    instagram
Name: SOCIAL MEDIA, dtype: object

In [31]:
pd.get_dummies(social_media)    #one hot encoding method

    facebook  instagram  youtube
0          0          1        0
1          1          0        0
2          0          0        1
3          1          0        0
4          0          1        0
5          0          1        0
6          0          0        1
7          0          1        0
8          0          0        1
9          0          1        0
10         0          1        0
11         0          0        1
12         0          1        0
13         0          1        0
14         0          0        1
15         0          0        1
16         0          1        0
17         0          1        0
18         0          0        1
19         0          1        0

In [32]:
Social_media_dummy = pd.get_dummies(social_media)

In [33]:
final_dummy_variable = Social_media_dummy.iloc[ : , 0:2]

In [34]:
final_dummy_variable

    facebook  instagram
0          0          1
1          1          0
2          0          0
3          1          0
4          0          1
5          0          1
6          0          0
7          0          1
8          0          0
9          0          1
10         0          1
11         0          0
12         0          1
13         0          1
14         0          0
15         0          0
16         0          1
17         0          1
18         0          0
19         0          1

In [35]:
y = dataset['MARKS EXPECTED OUT OF 100']

In [36]:
x

    USAGE TIME IN HOURS  STUDY HOURS
0                     1            2
1                     2            0
2                     2            2
3                     1            3
4                     1            1
5                     1            1
6                     2            3
7                     2            2
8                     1            2
9                     1            3
10                    1            2
11                    1            1
12                    1            2
13                    5            1
14                    1            2
15                    1            3
16                    2            2
17                    1            2
18                    1            3
19                    1            3

In [37]:
X = pd.concat([x , final_dummy_variable],axis=1)

In [38]:
X

    USAGE TIME IN HOURS  STUDY HOURS  facebook  instagram
0                     1            2         0          1
1                     2            0         1          0
2                     2            2         0          0
3                     1            3         1          0
4                     1            1         0          1
5                     1            1         0          1
6                     2            3         0          0
7                     2            2         0          1
8                     1            2         0          0
9                     1            3         0          1
10                    1            2         0          1
11                    1            1         0          0
12                    1            2         0          1
13                    5            1         0          1
14                    1            2         0          0
15                    1            3         0          0
16                    2            2         0          1
17                    1            2         0          1
18                    1            3         0          0
19                    1            3         0          1

In [39]:
X.shape

(20, 4)

In [40]:
y.shape

(20,)

In [41]:
from sklearn.model_selection import train_test_split

In [42]:
X_train, X_test, y_train , y_test= train_test_split(X,y ,test_size=0.20 , random_state=1)

In [43]:
from sklearn.linear_model import LinearRegression

In [44]:
model = LinearRegression()

In [45]:
model.fit(X_train,y_train)

LinearRegression()

In [46]:
y_preadict = model.predict(X_test)

In [47]:
y_preadict

array([40.89881593, 62.50627915, 67.43092931, 69.29314675])

In [48]:
X_test

    USAGE TIME IN HOURS  STUDY HOURS  facebook  instagram
3                     1            3         1          0
16                    2            2         0          1
6                     2            3         0          0
10                    1            2         0          1

In [49]:
y_test

3     75
16    85
6     60
10    70
Name: MARKS EXPECTED OUT OF 100, dtype: int64

In [50]:
model.fit(X,y)

LinearRegression()

In [51]:
LinearRegression()

LinearRegression()

In [52]:
from sklearn import metrics

In [53]:
metrics.mean_absolute_error(y_test,y_preadict)

16.183171869393618

In [54]:
model.coef_

array([ -6.49560019,   8.54201652, -12.25364412,   4.3198764 ])

In [55]:
model.intercept_

56.684019614428706